

#pragma once

#include "stdint.h"

/******************************************************************************************/
/* 基准电阻的阻值 */

#define PT100_Resistance_Ref 400.0f   /* PT100基准电阻的阻值 */
#define PT1000_Resistance_Ref 4000.0f /* PT1000基准电阻的阻值 */

/******************************************************************************************/

/******************************************************************************************/
/* 指令表 */

#define MAX31865_CONFIG_REG 0x00 /* 配置寄存器(00h、80h) */

#define MAX31865_RTD_MSB_REG 0x01 /* RTD电阻寄存器 - RTD MSBS(01h) */
#define MAX31865_RTD_LSB_REG 0x02 /* RTD电阻寄存器 - RTD LSBS(02h) */

#define MAX31865_RTD_HIGH_MSB_THRESHOLD_REG 0x03 /* 故障门限寄存器(03h、83h) */
#define MAX31865_RTD_HIGH_LSB_THRESHOLD_REG 0x04 /* 故障门限寄存器(04h、84h) */

#define MAX31865_RTD_LOW_MSB_THRESHOLD_REG 0x03 /* 故障门限寄存器(05h、85h) */
#define MAX31865_RTD_LOW_LSB_THRESHOLD_REG 0x04 /* 故障门限寄存器(06h、86h) */

#define MAX31865_FAULT_STATUS_REG 0x07 /* 故障状态寄存器(07h) */

/******************************************************************************************/

/******************************************************************************************/
/* 配置寄存器 */

#define MAX31865_Init_2_4_Line 0xC1 /* 2、4线模式 */
#define MAX31865_Init_3_Line 0xD1   /* 3线模式 */

/******************************************************************************************/

/******************************************************************************************/

extern void MAX31865_Set_Configuration(uint8_t data);
extern float Max31865_Read_Temperature(uint8_t sel);
void MAX31865_Clear_Fault_Status(void);
/******************************************************************************************/

#define GET_TECx_Temp(ch) Max31865_Read_Temperature(ch)
